CSI API ETABS v1

# cDesignForces Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDesignForces

    Public Interface cDesignForces

    Dim instance As cDesignForces

    public interface class cDesignForces

    type cDesignForces =  interface end

The cDesignForces type exposes the following members.

Methods

| Name| Description
---|---|---
|
BeamDesignForces|  Retrieves
design forces for an existing designed beam
|
BraceDesignForces|  Retrieves
design forces for an existing designed brace
|
ColumnDesignForces|  Retrieves
design forces for an existing designed column
|
PierDesignForces|  Retrieves
design forces for an existing designed pier
|
SpandrelDesignForces|  Retrieves
design forces for an existing designed spandrel
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com